{
    "changelogs": [
        {
            "version": "3.0.4",
            "type": "Hotfix",
            "date": "2025-08-13",
            "items": [
                {
                    "id": 1,
                    "type": "modification",
                    "description": "<b>General:</b> Added support for the missing DA and BOI ranks."
                },
                {
                    "id": 2,
                    "type": "addition",
                    "description": "<b>Arrest Calculator:</b> Added a DEPA Category Table, allowing people to quickly see which drugs falls under which category."
                },
                {
                    "id": 3,
                    "type": "modification",
                    "description": "<b>Paperwork Generators:</b> Reverted a previous change where only Prohibited Parking shows up in the parking citation section."
                },
                {
                    "id": 4,
                    "type": "modification",
                    "description": "<b>Arrest Calculator:</b> Added a link to the Drug Enforcement & Prevention Act to the actual DEPA alert."
                },
                {
                    "id": 5,
                    "type": "backend",
                    "description": "<b>Arrest Report:</b> Seperated the advanced and basic reports (and their outputs) into their own components, allowing the framework to re-use them if necessary."
                },
                {
                    "id": 6,
                    "type": "backend",
                    "description": "<b>Arrest Report:</b> Adjusted better handling of saving arrest reports to session storage, making sure that information won't reset upon reload. The advanced report will now also save the modifiers to your actual local storage."
                },
                {
                    "id": 7,
                    "type": "backend",
                    "description": "<b>Arrest Report:</b> Added handling for saving custom officer data to your localstorage, making it so additional fields (such as the callsign and division) can be saved."
                },
                {
                    "id": 7,
                    "type": "modification",
                    "description": "<b>General:</b> Adjusted the background image so it's a bit smaller."
                },
                {
                    "id": 8,
                    "type": "fix",
                    "description": "<b>General:</b> The background image is now scroll-locked and will always appear no matter where you scroll."
                },
                {
                    "id": 9,
                    "type": "feature",
                    "description": "<b>Arrest Calculator:</b> Added the ability to copy charges to clipboard directly from the arrest calculator results."
                },
                {
                    "id": 10,
                    "type": "backend",
                    "description": "<b>Arrest Calculator:</b> Made the arrest calculator it's own UI component, so it can be re-used easily on new pages."
                }
            ]
        },
        {
            "version": "3.0.3",
            "type": "Hotfix",
            "date": "2025-08-11",
            "items": [
                {
                    "id": 1,
                    "type": "fix",
                    "description": "<b>Arrest Calculator:</b> Fixed it so the bail cost is always the highest amount and not the total for all charges."
                },
                {
                    "id": 2,
                    "type": "fix",
                    "description": "<b>Arrest Calculator:</b> Add charge and calculate arrest buttons are always gonna remain on top of the charges, meaning you won't need to jump around to add the charges anymore."
                },
                {
                    "id": 3,
                    "type": "fix",
                    "description": "<b>General:</b> Fixed the favicon for the website."
                }
            ]
        },
        {
            "version": "3.0.2",
            "type": "Hotfix",
            "date": "2025-08-11",
            "items": [
                {
                    "id": 1,
                    "type": "fix",
                    "description": "<b>General:</b> Added a Detective rank for the Los Santos County Sheriff's Department."
                },
                {
                    "id": 2,
                    "type": "feature",
                    "description": "<b>Caselaw & Legal Resources:</b> Added a new Source & Year to each of the caselaws."
                },
                {
                    "id": 3,
                    "type": "fix",
                    "description": "<b>Caselaw & Legal Resources:</b> Adjusted the legal citing for the Traffic Citations resource."
                },
                {
                    "id": 4,
                    "type": "feature",
                    "description": "<b>Simplified Penal Code:</b> Added a way to filter by crime types."
                },
                {
                    "id": 5,
                    "type": "modification",
                    "description": "<b>Paperwork Generators:</b> Modified the parking ticket citation to only offer the charge for Prohibited Parking."
                },
                {
                    "id": 6,
                    "type": "modification",
                    "description": "<b>Arrest Report:</b> The arrest report will now show you the amount of days an impound / suspension should be in the summary."
                },
                {
                    "id": 7,
                    "type": "modification",
                    "description": "<b>Arrest Report:</b> Implemented the 25 day sentencing limit instituted by Legal Faction Management."
                },
                {
                    "id": 8,
                    "type": "fix",
                    "description": "<b>Caselaw & Legal Resources:</b> Adjusted the language of certain caselaws, to stay in line with continuity, California -> San Andreas, Los Angeles -> Los Santos."
                }
            ]
        },
        {
            "version": "3.0.1",
            "type": "Hotfix",
            "date": "2025-08-11",
            "items": [
                {
                    "id": 1,
                    "type": "modification",
                    "description": "<b>General:</b> Made the current version in the footer a clickable hyperlink to the changelog."
                },
                {
                    "id": 2,
                    "type": "fix",
                    "description": "<b>General:</b> Fixed the github link on the sidebar."
                },
                {
                    "id": 3,
                    "type": "backend",
                    "description": "<b>Framework:</b> Adjusted the dockerfile, fixing an issue regarding the serving of data to the production server."
                }
            ]
        },
        {
            "version": "3.0.0",
            "type": "Major Update",
            "date": "2025-08-11",
            "items": [
                {
                    "id": 1,
                    "type": "backend",
                    "description": "<b>Framework:</b> The website has been re-built from the ground up via next.js and react."
                },
                {
                    "id": 2,
                    "type": "modification",
                    "description": "<b>General:</b> The frontend layout, design and UX of the website has been redesigned."
                },
                {
                    "id": 3,
                    "type": "backend",
                    "description": "<b>Paperwork Generators:</b> The paperwork generators have been re-made and now compile via json instead of them being hard-coded, making any modification super simple."
                },
                {
                    "id": 4,
                    "type": "modification",
                    "description": "<b>Arrest Report:</b> The arrest report format has been changed to be as close to the realistic variant of the LA booking report"
                },
                {
                    "id": 5,
                    "type": "feature",
                    "description": "<b>Arrest Report:</b> Added an advanced variant of the arrest report, allowing for the Los Santos Police Department to continue using the MDC Panel"
                },
                {
                    "id": 6,
                    "type": "feature",
                    "description": "<b>Simplified Penal Code:</b> Added a simplified penal code to allow for quick-searching of charges and sentences."
                },
                {
                    "id": 7,
                    "type": "feature",
                    "description": "<b>Caselaw & Legal Resources:</b> Added a simple interface that allows for searching of caselaw and provides a simple overview to some legal resources."
                },
                {
                    "id": 8,
                    "type": "feature",
                    "description": "<b>General:</b> Added an announcements section to allow for more simple management of announcements."
                }
            ]
        }
    ]
}
